let heros = [
	{
    	name: '矮人直升机',
    	heroTag:['敏捷','爆发'],
    	talent:{
    		10:['+225生命','+6%技能增强'],
    		15:['+30攻击力','+15%魔法抗性'],
    		20:['20%冷却时间减少','+35移动速度'],
    		25:['+4高射火炮攻击次数','+3追踪导弹能量点数']
    	}
  	},
  	{
    	name: '暗夜魔王',
    	heroTag:['力量','控制','耐久'],
    	talent:{
    		10:['+100施法距离','+7力量'],
    		15:['+25攻击速度','+300魔法'],
    		20:['+50攻击力','+30移动速度'],
    		25:['-8秒伤残恐惧冷却时间','+12护甲']
    	}
  	},
  	{
    	name: '暗影萨满',
    	heroTag:['智力','控制'],
    	talent:{
    		10:['+25移动速度','+200生命'],
    		15:['+35%经验获取','+100施法距离'],
    		20:['+3s枷锁持续时间','+4召唤的守卫'],
    		25:['+350苍穹震击伤害','+1群蛇守卫可被攻击次数']
    	}
  	},
  	{
    	name: '半人马战行者',
    	heroTag:['力量','控制','耐久'],
    	talent:{
    		10:['+2魔法恢复','+35攻击力'],
    		15:['+10%魔法抗性','+10闪避'],
    		20:['+15力量','+10%技能增强'],
    		25:['+1s马蹄践踏持续时间','反击变成光环']
    	}
  	},
  	{
    	name: '编织者',
    	heroTag:['敏捷','耐久'],
    	talent:{
    		10:['+30缩地伤害','+6力量'],
    		15:['+7全属性','+25攻击力'],
    		20:['+15敏捷','+200生命'],
    		25:['+200缩地移动速度','+35%魔法抗性']
    	}
  	},
  	{
    	name: '蝙蝠骑士',
    	heroTag:['智力','控制'],
    	talent:{
    		10:['+4护甲','+10智力'],
    		15:['+200生命','+5%技能增强'],
    		20:['+35移动速度','15%冷却时间减少'],
    		25:['+300烈焰破击范围/击退','+8s火焰飞行持续时间']
    	}
  	},
  	{
    	name: '不朽尸王',
    	heroTag:['力量','耐久'],
    	talent:{
    		10:['+90金钱/分','+15生命恢复'],
    		15:['+300生命','+35%经验获取'],
    		20:['+30移动速度','+50墓碑僵尸攻击力'],
    		25:['-2s腐朽冷却','+15护甲']
    	}
  	},
  	{
    	name: '潮汐猎人',
    	heroTag:['力量','控制','耐久'],
    	talent:{
    		10:['+150生命','+50攻击力'],
    		15:['+35%经验获取','+7护甲'],
    		20:['+15力量','+6魔法恢复'],
    		25:['-6巨浪降低护甲','20%冷却时间减少']
    	}
  	},
  	{
    	name: '沉默术士',
    	heroTag:['智力'],
    	talent:{
    		10:['+7智力','+4护甲'],
    		15:['+60金钱/分','+200生命'],
    		20:['+12%魔法抗性','+30攻击速度'],
    		25:['+25%诅咒减速','+200攻击距离']
    	}
  	},
  	{
    	name: '戴泽',
    	heroTag:['智力','耐久'],
    	talent:{
    		10:['+125生命','+10智力'],
    		15:['+60攻击力','+100施法距离'],
    		20:['+25剧毒之触每秒伤害','+25移动速度'],
    		25:['+60暗影波治疗','-6s剧毒之触冷却']
    	}
  	},
  	{
    	name: '敌法师',
    	heroTag:['敏捷','爆发'],
    	talent:{
    		10:['+20攻击力','+150生命'],
    		15:['-1s闪烁冷却','+20攻击速度'],
    		20:['+10全属性','+15%闪避'],
    		25:['-50s法力虚空冷却','+25敏捷']
    	}
  	},
  	{
    	name: '发条技师',
    	heroTag:['力量','控制','耐久'],
    	talent:{
    		10:['+200魔法','+4护甲'],
    		15:['+75照明火箭伤害','+50攻击力'],
    		20:['+12%魔法抗性','+40弹幕冲击伤害'],
    		25:['+10s弹幕冲击持续时间','+400生命']
    	}
  	},
  	{
    	name: '风暴之灵',
    	heroTag:['智力','爆发'],
    	talent:{
    		10:['+3魔法恢复','+20攻击力'],
    		15:['+10智力','+200生命'],
    		20:['+8护甲','+40攻击速度'],
    		25:['+0.75s电子涡流持续时间','+10%技能增强']
    	}
  	},
  	{
    	name: '风行者',
    	heroTag:['智力','控制','爆发'],
    	talent:{
    		10:['+30%风行减速','+4魔法恢复'],
    		15:['+20智力','+40移动速度'],
    		20:['+120强力击伤害','风行提供隐身效果'],
    		25:['30%冷却时间减少','+150攻击距离']
    	}
  	},
  	{
    	name: '斧王',
    	heroTag:['力量','控制','耐久'],
    	talent:{
    		10:['+3魔法恢复','+6力量'],
    		15:['+250生命','+75攻击力'],
    		20:['+35移动速度','+25生命恢复'],
    		25:['+100战斗饥渴每秒伤害','+15护甲']
    	}
  	},
  	{
    	name: '复仇之魂',
    	heroTag:['敏捷','控制'],
    	talent:{
    		10:['+25攻击速度','+8%魔法抗性'],
    		15:['+100魔法箭伤害','+8全属性'],
    		20:['+35移动速度','+65攻击力'],
    		25:['魔法箭无视技能免疫','+20%复仇光环攻击力']
    	}
  	},
  	{
    	name: '干扰者',
    	heroTag:['智力','控制'],
    	talent:{
    		10:['+60金钱/分','+100施法距离'],
    		15:['+40雷霆之击伤害','-3s动能力场冷却'],
    		20:['+10%技能增强','+400生命'],
    		25:['+30%魔法抗性','+4雷霆之击打击次数']
    	}
  	},
  	{
    	name: '钢背兽',
    	heroTag:['力量','耐久'],
    	talent:{
    		10:['+2魔法恢复','+8力量'],
    		15:['+4鼻涕叠加上限','+225生命'],
    		20:['+10%技能吸血','+50攻击速度'],
    		25:['+25刺针叠加伤害','+30生命恢复']
    	}
  	},
  	{
    	name: '哈斯卡',
    	heroTag:['力量','爆发'],
    	talent:{
    		10:['+5沸血之矛伤害','+175生命'],
    		15:['15%吸血','+30攻击力'],
    		20:['+40攻击速度','+15力量'],
    		25:['+500牺牲施法距离','+100攻击距离']
    	}
  	},
  	{
    	name: '寒冬飞龙',
    	heroTag:['智力','控制'],
    	talent:{
    		10:['+7力量','+8智力'],
    		15:['+50攻击力','+20移动速度'],
    		20:['+1s极寒之拥持续时间','+120金钱/分'],
    		25:['-3s碎裂冲击冷区','+15%极寒灼烧减速']
    	}
  	},
  	{
    	name: '撼地者',
    	heroTag:['力量','控制'],
    	talent:{
    		10:['+250魔法','+10力量'],
    		15:['+50攻击力','+20移动速度'],
    		20:['+350沟壑距离','+40回音伤害'],
    		25:['-2s强化图腾冷却','+600生命']
    	}
  	},
  	{
    	name: '黑暗贤者',
    	heroTag:['智力','控制','耐久'],
    	talent:{
    		10:['+100施法距离','+12%闪避'],
    		15:['+14生命恢复','+120攻击力'],
    		20:['+75真空范围','10%冷却时间减少'],
    		25:['+80离子外壳伤害','+25力量']
    	}
  	},
  	{
    	name: '幻影刺客',
    	heroTag:['敏捷','爆发'],
    	talent:{
    		10:['+15攻击力','+150生命'],
    		15:['+20移动速度','10%吸血'],
    		20:['+10全属性','+35攻击速度'],
    		25:['窒息之刃攻击两个目标','+25敏捷']
    	}
  	},
  	{
    	name: '幻影长矛手',
    	heroTag:['敏捷','耐久'],
    	talent:{
    		10:['+20攻击速度','+75灵魂之矛伤害'],
    		15:['15%冷却时间减少','+8全属性'],
    		20:['15%闪避','+15%魔法抗性'],
    		25:['+600幻影冲锋距离','+20力量']
    	}
  	},
  	{
    	name: '混沌骑士',
    	heroTag:['力量','控制','爆发','耐久'],
    	talent:{
    		10:['+8智力','+15攻击速度'],
    		15:['+10力量','+20移动速度'],
    		20:['+12全属性','+120金钱/分'],
    		25:['实相裂隙无视技能免疫','20%冷却时间减少']
    	}
  	},
  	{
    	name: '祸乱之源',
    	heroTag:['智力','控制'],
    	talent:{
    		10:['+200魔法','+6护甲'],
    		15:['+30%经验获取','+250生命'],
    		20:['+175施法距离','+90虚弱攻击力降低'],
    		25:['+200蚀脑伤害/治疗','+100移动速度']
    	}
  	},
  	{
    	name: '杰奇洛',
    	heroTag:['智力','控制','耐久'],
    	talent:{
    		10:['+8%技能增强','+25%经验获取'],
    		15:['+35冰火交加伤害','+125施法距离'],
    		20:['+150金钱/分','+400攻击距离'],
    		25:['+1.25s冰封路径持续时间','烈焰焚身变为纯粹且']
    	}
  	},
  	{
    	name: '酒仙',
    	heroTag:['力量','控制','耐久'],
    	talent:{
    		10:['+3魔法恢复','+30攻击力'],
    		15:['+15%魔法抗性','+75雷霆一击伤害'],
    		20:['+20力量','+2s雷霆一击减速'],
    		25:['+2000元素分离单位生命','+140攻击速度']
    	}
  	},
  	{
    	name: '狙击手',
    	heroTag:['敏捷','爆发'],
    	talent:{
    		10:['+15攻击速度','+5魔法恢复'],
    		15:['+200生命','+20榴霰弹每秒伤害'],
    		20:['25%冷却时间减少','+8护甲'],
    		25:['+4榴霰弹能量点数','+100攻击距离']
    	}
  	},
  	{
    	name: '剧毒术士',
    	heroTag:['敏捷','耐久'],
    	talent:{
    		10:['+30移动速度','+30%经验获取'],
    		15:['+150施法距离','+200生命'],
    		20:['+15%魔法抗性','+75攻击力'],
    		25:['3倍瘟疫守卫生命/伤害','+14%毒刺减速']
    	}
  	},
  	{
    	name: '军团指挥官',
    	heroTag:['力量','耐久','爆发'],
    	talent:{
    		10:['+20%经验获取','+7力量'],
    		15:['+20移动速度','+30攻击力'],
    		20:['+10%勇气之霎触发几率','+7护甲'],
    		25:['-8s强攻冷却','+40决斗攻击力加成']
    	}
  	},
  	{
    	name: '克林克兹',
    	heroTag:['敏捷','爆发'],
    	talent:{
    		10:['+10%魔法抗性','+10智力'],
    		15:['+30灼热之箭伤害','+15力量'],
    		20:['+10全属性','20%闪避'],
    		25:['+70扫射攻击速度','+125攻击距离']
    	}
  	},
  	{
    	name: '恐怖利刃',
    	heroTag:['敏捷','爆发'],
    	talent:{
    		10:['+15攻击速度','+6生命恢复'],
    		15:['+200生命','+25攻击力'],
    		20:['+25移动速度','+15敏捷'],
    		25:['-30s魂断冷却','+15全属性']
    	}
  	},
  	{
    	name: '昆卡',
    	heroTag:['力量','控制'],
    	talent:{
    		10:['+40洪流伤害','+30攻击力'],
    		15:['+30移动速度','+15生命恢复'],
    		20:['+120金钱/分','+300生命'],
    		25:['+200洪流范围','+35%魔法抗性']
    	}
  	},
  	{
    	name: '拉席克',
    	heroTag:['智力','控制','爆发'],
    	talent:{
    		10:['+25移动速度','+175生命'],
    		15:['+15%魔法抗性','+400魔法'],
    		20:['+15力量','+5%技能增强'],
    		25:['+3s闪电风暴减速','+50恶魔赦令爆炸次数']
    	}
  	},
  	{
    	name: '莱恩',
    	heroTag:['智力','控制','爆发'],
    	talent:{
    		10:['+60攻击力','+75施法距离'],
    		15:['+90金钱/分','+80裂地尖刺伤害'],
    		20:['+8%技能增强','+20%魔法抗性'],
    		25:['+3法力汲取多个目标','+20全属性']
    	}
  	},
  	{
    	name: '狼人',
    	heroTag:['力量','爆发'],
    	talent:{
    		10:['+200生命','+15攻击力'],
    		15:['+12力量','+12野性驱使生命恢复'],
    		20:['15%冷却时间减少','15%闪避'],
    		25:['+2召狼数量','+15s变身持续时间']
    	}
  	},
  	{
    	name: '力丸',
    	heroTag:['敏捷','爆发'],
    	talent:{
    		10:['+15移动速度','+150生命'],
    		15:['+30%经验获取','+10敏捷'],
    		20:['+8全属性','+250施法距离'],
    		25:['-4s烟雾冷却','+0.4背刺系数']
    	}
  	},
  	{
    	name: '莉娜',
    	heroTag:['智力','控制','爆发'],
    	talent:{
    		10:['+125施法距离','+80光击阵伤害'],
    		15:['+40移动速度','+50攻击力'],
    		20:['+150攻击距离','+6%技能增强'],
    		25:['+35/3%炽魂每次叠加','-4s龙破斩冷却']
    	}
  	},
  	{
    	name: '炼金术士',
    	heroTag:['力量','控制','耐久'],
    	talent:{
    		10:['+4护甲','+20攻击力'],
    		15:['+6全属性','+100不稳定化合物伤害'],
    		20:['+300生命','+30攻击速度'],
    		25:['-5酸性喷雾降低护甲','30%吸血']
    	}
  	},
  	{
    	name: '裂魂人',
    	heroTag:['力量','控制'],
    	talent:{
    		10:['+20移动速度','+5全属性'],
    		15:['+5护甲','+20攻击力'],
    		20:['+30%巨力冲击伤害','+120金钱/分'],
    		25:['+500冲刺速度','+17%巨力重击概率']
    	}
  	},
  	{
    	name: '龙骑士',
    	heroTag:['力量','控制','爆发'],
    	talent:{
    		10:['+30攻击速度','+10力量'],
    		15:['+40攻击力','+40%经验获取'],
    		20:['+300生命','+120金钱/分'],
    		25:['2倍龙族血统生命恢复/护甲','+75移动速度']
    	}
  	},
  	{
    	name: '露娜',
    	heroTag:['敏捷','控制','爆发'],
    	talent:{
    		10:['+20移动速度','+15攻击力'],
    		15:['+40月光伤害','+150生命'],
    		20:['+15%魔法抗性','+25攻击速度'],
    		25:['-4s月光冷却','+15全属性']
    	}
  	},
  	{
    	name: '马格纳斯',
    	heroTag:['力量','控制'],
    	talent:{
    		10:['+15%技能增强','+25攻击速度'],
    		15:['+12力量','+90金钱/分'],
    		20:['+40移动速度','+10%授予力量攻击力/分裂'],
    		25:['+15护甲','+500巨角冲撞距离']
    	}
  	},
  	{
    	name: '美杜莎',
    	heroTag:['敏捷','控制','耐久'],
    	talent:{
    		10:['+15攻击力','+12智力'],
    		15:['15%闪避','+20攻击速度'],
    		20:['+600魔法','+1分裂箭目标'],
    		25:['+2s石化凝视眩晕','25%吸血']
    	}
  	},
  	{
    	name: '魅惑魔女',
    	heroTag:['智力','爆发'],
    	talent:{
    		10:['+25移动速度','+6全属性'],
    		15:['+50攻击力','+8自然之助小精灵'],
    		20:['+60不可侵犯减速','+15%魔法抗性'],
    		25:['魅惑可作用远古','+6%推进伤害']
    	}
  	},
  	{
    	name: '谜团',
    	heroTag:['智力','控制'],
    	talent:{
    		10:['+12%魔法抗性','+20移动速度'],
    		15:['+120金钱/分','15%冷却时间减少'],
    		20:['+1憎恶触发次数','+300生命'],
    		25:['+8恶魔转化虚灵','+12护甲']
    	}
  	},
  	{
    	name: '米拉娜',
    	heroTag:['敏捷','控制','爆发'],
    	talent:{
    		10:['+150生命','+8敏捷'],
    		15:['+30攻击速度','+5%技能增强'],
    		20:['-4s月神之箭冷却','+50攻击力'],
    		25:['+2月神之箭齐发','+100跳跃攻击速度']
    	}
  	},
  	{
    	name: '冥魂大帝',
    	heroTag:['力量','控制','耐久'],
    	talent:{
    		10:['+10智力','+15攻击力'],
    		15:['+50冥火暴击每秒伤害','+15移动速度'],
    		20:['+10%吸血光环吸血','+40攻击速度'],
    		25:['重生施放冥火暴击','重生不消耗魔法']
    	}
  	},
  	{
    	name: '冥界亚龙',
    	heroTag:['敏捷','耐久'],
    	talent:{
    		10:['+175生命','+15攻击力'],
    		15:['+16敏捷','+15力量'],
    		20:['+75攻击距离','毒性攻击影响建筑'],
    		25:['+80蝮蛇突袭每秒伤害','+20护甲']
    	}
  	},
  	{
    	name: '殁境神蚀者',
    	heroTag:['智力','爆发'],
    	talent:{
    		10:['+10移动速度','+250魔法'],
    		15:['+20攻击速度','+5护甲'],
    		20:['+275生命','+15智力'],
    		25:['+8%技能增强','+60s奥术天球智力窃取']
    	}
  	},
  	{
    	name: '娜迦海妖',
    	heroTag:['敏捷','控制','耐久'],
    	talent:{
    		10:['+125生命','+250魔法'],
    		15:['-3s诱捕冷却','+30攻击速度'],
    		20:['+20力量','+15敏捷'],
    		25:['+1镜像幻象','+40移动速度']
    	}
  	},
  	{
    	name: '孽主',
    	heroTag:['力量','控制','耐久'],
    	talent:{
    		10:['+2魔法恢复','+5护甲'],
    		15:['+12%技能增强','+40移动速度'],
    		20:['+125施法距离','+60攻击速度'],
    		25:['+0.4s怨念深渊缠绕','+50生命恢复']
    	}
  	},
  	{
    	name: '帕格纳',
    	heroTag:['智力','爆发'],
    	talent:{
    		10:['+225生命','+3魔法恢复'],
    		15:['-1s幽冥爆轰冷却','+1s衰老持续时间'],
    		20:['+150施法距离','+0.75幽冥守卫伤害系数'],
    		25:['+200幽冥爆轰伤害','+50%生命汲取回复']
    	}
  	},
  	{
    	name: '帕吉',
    	heroTag:['力量','控制','耐久'],
    	talent:{
    		10:['+2魔法恢复','+8力量'],
    		15:['+15移动速度','+5护甲'],
    		20:['+1s肢解持续时间','+150金钱/分'],
    		25:['+120腐烂伤害','+1.75腐肉堆积叠加力量']
    	}
  	},
  	{
    	name: '全能骑士',
    	heroTag:['力量','耐久'],
    	talent:{
    		10:['+20%经验获取','+60金钱/分'],
    		15:['+8力量','+75施法距离'],
    		20:['+6魔法恢复','+100攻击力'],
    		25:['-16%退化光环','+200洗礼伤害/治疗']
    	}
  	},
  	{
    	name: '沙王',
    	heroTag:['力量','控制'],
    	talent:{
    		10:['+5护甲','+10%魔法抗性'],
    		15:['-50地震攻速降低','+50沙尘暴每秒伤害'],
    		20:['+120金钱/分','+350生命'],
    		25:['+4地震波数','+50生命恢复']
    	}
  	},
  	{
    	name: '赏金猎人',
    	heroTag:['敏捷','爆发'],
    	talent:{
    		10:['+20%经验获取','+175生命'],
    		15:['+15移动速度','+40攻击速度'],
    		20:['+120攻击力','+75投掷飞镖伤害'],
    		25:['-5s忍术冷却','25%闪避']
    	}
  	},
  	{
    	name: '上古巨神',
    	heroTag:['力量','控制'],
    	talent:{
    		10:['+10力量','+200魔法'],
    		15:['+30回音践踏伤害','+275生命'],
    		20:['+50攻击速度','+12%魔法抗性'],
    		25:['+100星体游魂触碰英雄额外攻击力','+15护甲']
    	}
  	},
  	{
    	name: '神谕者',
    	heroTag:['智力','耐久'],
    	talent:{
    		10:['+20%经验获取','+0.75s气运之末最大持续时间'],
    		15:['+60金钱/分','+200生命'],
    		20:['+20智力','+25移动速度'],
    		25:['+2s虚妄芝诺持续时间','+250施法距离']
    	}
  	},
  	{
    	name: '嗜血狂魔',
    	heroTag:['敏捷','爆发'],
    	talent:{
    		10:['+225生命','+25攻击力'],
    		15:['+75血之祭祀伤害','+30攻击速度'],
    		20:['+10全属性','+14%割裂伤害'],
    		25:['30%吸血','-7s血之祭祀冷却']
    	}
  	},
  	{
    	name: '噬魂鬼',
    	heroTag:['力量','控制','爆发'],
    	talent:{
    		10:['+15攻击速度','+5全属性'],
    		15:['+265攻击力','+250生命'],
    		20:['+25移动速度','15%闪避'],
    		25:['+1s狂暴持续时间','+15护甲']
    	}
  	},
  	{
    	name: '术士',
    	heroTag:['智力','控制'],
    	talent:{
    		10:['+6全属性','+20%经验获取'],
    		15:['-4s暗言术冷却','+150施法距离'],
    		20:['死亡时召唤地狱火','+350生命'],
    		25:['+15地狱火护甲','地狱火技能免疫']
    	}
  	},
  	{
    	name: '树精卫士',
    	heroTag:['力量','控制','耐久'],
    	talent:{
    		10:['+2魔法恢复','+30攻击速度'],
    		15:['+25移动速度','+90金钱/分'],
    		20:['+90攻击力','15%冷却时间减少'],
    		25:['+5活体护甲格挡次数','+40寄生种子伤害/治疗']
    	}
  	},
  	{
    	name: '水晶室女',
    	heroTag:['智力','控制'],
    	talent:{
    		10:['+60攻击力','+15%魔法抗性'],
    		15:['+250生命','+125施法距离'],
    		20:['+50极寒领域伤害','+120金钱/分'],
    		25:['+300冰霜信息伤害','+1.5s冰封禁制持续时间']
    	}
  	},
  	{
    	name: '司夜刺客',
    	heroTag:['敏捷','控制','爆发'],
    	talent:{
    		10:['+175生命','+5%技能增强'],
    		15:['+50穿刺伤害','+12%魔法抗性'],
    		20:['+40敏捷','+120金钱/分'],
    		25:['200%尖刺外壳伤害','+40移动速度']
    	}
  	},
  	{
    	name: '斯拉达',
    	heroTag:['力量','控制'],
    	talent:{
    		10:['+175魔法','+6生命恢复'],
    		15:['+25攻击速度','+225生命'],
    		20:['+7护甲','+35攻击力'],
    		25:['+10%击晕概率','+20力量']
    	}
  	},
  	{
    	name: '斯拉克',
    	heroTag:['敏捷','控制','爆发'],
    	talent:{
    		10:['+15攻击力','10%吸血'],
    		15:['+15力量','+15敏捷'],
    		20:['+25攻击速度','10%冷却时间减少'],
    		25:['+3s突袭束缚时间','+12全属性']
    	}
  	},
  	{
    	name: '斯温',
    	heroTag:['力量','控制','爆发','耐久'],
    	talent:{
    		10:['+225魔法','+6力量'],
    		15:['+8全属性','+20移动速度'],
    		20:['20%闪避','+30攻击速度'],
    		25:['-8s风暴之拳冷却','+65攻击力']
    	}
  	},
  	{
    	name: '死亡先知',
    	heroTag:['智力','耐久'],
    	talent:{
    		10:['+12%魔法抗性','+5%技能增强'],
    		15:['+150施法距离','-1.5s地穴虫群冷却'],
    		20:['+50移动速度','10%冷却时间减少'],
    		25:['+8驱使恶灵数量','+600生命']
    	}
  	},
  	{
    	name: '剃刀',
    	heroTag:['敏捷','耐久'],
    	talent:{
    		10:['+15敏捷','+25移动速度'],
    		15:['+175施法距离','+130不稳定电流伤害'],
    		20:['+40攻击速度','+400生命'],
    		25:['+14静电链接攻击力窃取','+175攻击距离']
    	}
  	},
  	{
    	name: '天怒法师',
    	heroTag:['智力','爆发'],
    	talent:{
    		10:['+7智力','+150生命'],
    		15:['+90金钱/分','10%技能吸血'],
    		20:['+20%魔法抗性','+40移动速度'],
    		25:['-4s上古封印冷却','+14魔法恢复']
    	}
  	},
  	{
    	name: '天穹守望者',
    	heroTag:['敏捷'],
    	talent:{
    		10:['+25攻击速度','+20乱流每秒伤害'],
    		15:['+200生命','+30攻击力'],
    		20:['+100攻击距离','10%冷却时间减少'],
    		25:['+250闪光幽魂伤害','30%吸血']
    	}
  	},
  	{
    	name: '痛苦女王',
    	heroTag:['智力','爆发'],
    	talent:{
    		10:['+10力量','+25攻击力'],
    		15:['+90金钱/分','12%冷却时间减少'],
    		20:['+300生命','+100攻击距离'],
    		25:['60%技能吸血','暗影突袭变为550范围技能']
    	}
  	},
  	{
    	name: '瘟疫法师',
    	heroTag:['智力','耐久'],
    	talent:{
    		10:['+8力量','+40攻击力'],
    		15:['+20移动速度','+6全属性'],
    		20:['+10%魔法抗性','+5%技能增强'],
    		25:['-1s死亡脉冲冷却','+400生命']
    	}
  	},
  	{
    	name: '巫妖',
    	heroTag:['智力','爆发'],
    	talent:{
    		10:['+25移动速度','+175生命'],
    		15:['-4s寒霜爆发冷却','+125施法距离'],
    		20:['+120金钱/分','+150攻击力'],
    		25:['普攻减30%攻速和移速','+35霜冻护甲对建筑加成']
    	}
  	},
  	{
    	name: '巫医',
    	heroTag:['智力','控制'],
    	talent:{
    		10:['+25%经验获取','+200生命'],
    		15:['+2麻痹药剂弹跳','+90攻击力'],
    		20:['+15%魔法抗性','+8护甲'],
    		25:['+20巫毒回复术治疗','+175死亡守卫攻击距离']
    	}
  	},
  	{
    	name: '先知',
    	heroTag:['智力','爆发'],
    	talent:{
    		10:['+250生命','+30攻击力'],
    		15:['+4召唤树人','+20智力'],
    		20:['+10护甲','+35攻击速度'],
    		25:['2倍树人生命/攻击力','传送无冷却']
    	}
  	},
  	{
    	name: '小小',
    	heroTag:['力量','控制','爆发'],
    	talent:{
    		10:['+14智力','+8力量'],
    		15:['+40移动速度','+60攻击力'],
    		20:['+14魔法恢复','+25攻击速度'],
    		25:['+200山崩伤害','20%冷却时间减少']
    	}
  	},
  	{
    	name: '熊战士',
    	heroTag:['敏捷','耐久','爆发'],
    	talent:{
    		10:['+10%魔法抗性','+25攻击力'],
    		15:['+20攻击速度','+5护甲'],
    		20:['+250生命','+15移动速度'],
    		25:['+10怒意狂击伤害','+14全属性']
    	}
  	},
  	{
    	name: '修补匠',
    	heroTag:['智力','爆发'],
    	talent:{
    		10:['+6护甲','+8智力'],
    		15:['+4%技能增强','+225生命'],
    		20:['+15%魔法抗性','+75施法距离'],
    		25:['+100激光伤害','20%技能吸血']
    	}
  	},
  	{
    	name: '虚空假面',
    	heroTag:['敏捷','控制'],
    	talent:{
    		10:['+8力量','+15攻击速度'],
    		15:['+25攻击力','+7护甲'],
    		20:['+120金钱/分','+300生命'],
    		25:['+600时间漫游距离','20%闪避']
    	}
  	},
  	{
    	name: '亚巴顿',
    	heroTag:['力量','耐久'],
    	talent:{
    		10:['+20%经验获取','+20攻击力'],
    		15:['+5护甲','+200魔法'],
    		20:['15%冷却时间减少','+25移动速度'],
    		25:['+300无光之盾吸收','+25力量']
    	}
  	},
  	{
    	name: '育母蜘蛛',
    	heroTag:['敏捷','耐久'],
    	talent:{
    		10:['+25%经验获取','+60孵化蜘蛛伤害'],
    		15:['+350生命','20%冷却时间减少'],
    		20:['+70攻击速度','+14小蜘蛛攻击力'],
    		25:['+225小蜘蛛生命值','+8蛛网上限']
    	}
  	},
  	{
    	name: '远古冰魄',
    	heroTag:['智力','爆发'],
    	talent:{
    		10:['+8%技能增强','+60金钱/分'],
    		15:['+30生命恢复','-1s冰霜漩涡冷却'],
    		20:['+8%冰霜漩涡减速/伤害加深','+400生命'],
    		25:['+100极寒之触伤害','4寒霜之足能量点数']
    	}
  	},
  	{
    	name: '宙斯',
    	heroTag:['智力','爆发'],
    	talent:{
    		10:['+25移动速度','+2魔法恢复'],
    		15:['+15%魔法抗性','+7护甲'],
    		20:['+0.5s雷击眩晕','+75弧形闪电伤害'],
    		25:['+2%静电场伤害','+200施法距离']
    	}
  	},
  	{
    	name: '主宰',
    	heroTag:['敏捷','爆发'],
    	talent:{
    		10:['+20攻击力','+175生命'],
    		15:['+7护甲','+20攻击速度'],
    		20:['+8全属性','+20移动速度'],
    		25:['+175剑刃风暴每秒伤害','+20敏捷']
    	}
  	},
  	{
    	name: '卓尔游侠',
    	heroTag:['敏捷','爆发'],
    	talent:{
    		10:['+5全属性','+15移动速度'],
    		15:['+20攻击速度','+175生命'],
    		20:['+14力量','+6%精准光环攻击力'],
    		25:['+25射手天赋敏捷','+400狂风距离/击退']
    	}
  	}
];

// heros.forEach((e,i)=>{
// 	e.src = require('./../assets/'+e.name+'.jpg');
// })

export default heros
